Revit 2026 API

# StairsSupportTopsideSurfaceType Enumeration

---

The style of the topside surface of the support.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StairsSupportTopsideSurfaceType
```
```vb
Public Enumeration StairsSupportTopsideSurfaceType
```
```cpp
public enum class StairsSupportTopsideSurfaceType
```
```fsharp
type StairsSupportTopsideSurfaceType
```

| Member name | Value | Description |
| --- | --- | --- |
| Closed | 0 | The style of the topside surface of the support is closed. |
| Open | 1 | The style of the topside surface of the support is open. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace